In [1]:
%matplotlib inline

In [2]:
import pandas as pd
import matplotlib as plt
import numpy as np
from matplotlib.ticker import MultipleLocator
import statistics

In [3]:
#file to load
cityDataToLoad = 'resources/city_data.csv'
rideDataToLoad = 'resources/ride_data.csv'

In [5]:
cityDataDf = pd.read_csv(cityDataToLoad)
cityDataDf

                city  driver_count   type
0        Richardfort            38  Urban
1       Williamsstad            59  Urban
2        Port Angela            67  Urban
3         Rodneyfort            34  Urban
4        West Robert            39  Urban
..               ...           ...    ...
115     Bradshawfurt             7  Rural
116     New Ryantown             2  Rural
117   Randallchester             9  Rural
118      Jessicaport             1  Rural
119  South Saramouth             7  Rural

[120 rows x 3 columns]

In [7]:
rideDataDf = pd.read_csv(rideDataToLoad)
rideDataDf

                    city                 date   fare        ride_id
0     Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1     South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2     Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3             Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4             South Jack  2019-03-06 04:28:35  34.58  3908451377344
...                  ...                  ...    ...            ...
2370         Michaelberg  2019-04-29 17:04:39  13.38  8550365057598
2371     Lake Latoyabury  2019-01-30 00:05:47  20.76  9018727594352
2372         North Jaime  2019-02-10 21:03:50  11.11  2781339863778
2373        West Heather  2019-05-07 19:22:15  44.94  4256853490277
2374          Newtonview  2019-04-25 10:20:13  55.84  9990581345298

[2375 rows x 4 columns]

In [9]:
#chekcing data types and data info
cityDataDf.dtypes
cityDataDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   city          120 non-null    object
 1   driver_count  120 non-null    int64
 2   type          120 non-null    object
dtypes: int64(1), object(2)
memory usage: 2.9+ KB

In [10]:
#counting all records
cityDataDf.count()

city            120
driver_count    120
type            120
dtype: int64

In [11]:
#double check, no null values
cityDataDf.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [13]:
cityDataDf['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [14]:
urbanCount = sum(cityDataDf['type']=='Urban')
urbanCount

66

In [15]:
suburbCount = sum(cityDataDf['type']=='Suburban')
suburbCount

36

In [16]:
ruralCount = sum(cityDataDf['type']=='Rural')
ruralCount

18

In [17]:
rideDataDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2375 entries, 0 to 2374
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   city     2375 non-null   object
 1   date     2375 non-null   object
 2   fare     2375 non-null   float64
 3   ride_id  2375 non-null   int64
dtypes: float64(1), int64(1), object(2)
memory usage: 74.3+ KB

In [18]:
rideDataDf.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [20]:
pyBerDataComplete = pd.merge(rideDataDf,cityDataDf, how = 'left',on=['city','city'])
pyBerDataComplete.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban